package com.yundao.tenant.web.constant;

/**
 * 提示编码常量
 *
 * @author jan
 * @create 2017-07-20 PM1:51
 **/
public interface CodeConstant {

    /**
     * 登录超时
     */
    int CODE_900000 = 900000;

    /**
     * 无效的身份标识
     */
    int CODE_900001 = 900001;

    /**
     * 无权限访问
     */
    int CODE_900002 = 900002;

    /**
     * 域名未授权
     */
    int CODE_900003 = 900003;
    /**
     * 该帐号未授权
     */
    int CODE_900004 = 900004;
    /**
     * 域名未授权
     */
    int CODE_900005 = 900005;

    /**
     * 数据创建者为空
     */
    int CODE_900006 = 900006;

    /**
     * 登录已失效
     */
    int CODE_900007 = 900007;

    /**
     * 未认证登录
     */
    int CODE_900008 = 900008;

    /**
     * 请在DTO标注“FieldCode”注解
     */
    int CODE_900009 = 900009;

    /**
     * 只能上传xls、xlsx文件
     */
    int CODE_900010 = 900010;

    /**
     * 模板列表为空
     */
    int CODE_900011 = 900011;

    /**
     * 模板格式错误，请重新下载模板
     */
    int CODE_900012 = 900012;

    /**
     * 上传数量超出限制
     */
    int CODE_900013 = 900013;

    /**
     * 上传的数据存在重复手机号码
     */
    int CODE_900014 = 900014;

    /**
     * 销售线索数不存在
     */
    int CODE_900015 = 900015;

    /**
     * 缺少配置项
     */
    int CODE_900016 = 900016;

    /**
     * userId不能为空
     */
    int CODE_900017 = 900017;

    /**
     * tenantId不能为空
     */
    int CODE_900018 = 900018;

    /**
     * id不能为空
     */
    int CODE_1200000 = 1200000;

    /**
     * 您没有权限操作
     */
    int CODE_1220015 = 1220015;

    /**
     * 无权限操作
     */
    int CODE_1220016 = 1220016;

    /**
     * 无权限操作
     */
    int CODE_1220019 = 1220019;

    /**
     * 无效的数据对象编码
     */
    int CODE_1220035 = 1220035;

    /**
     * 用户已离职,不能登录！
     */
    int CODE_1200117 = 1200117;
    /**
     * 该账号已停用，请联系管理员
     */
    int CODE_1200118 = 1200118;
    /**
     * 登录失败
     */
    int CODE_1200119 = 1200119;
    /**
     * 发起人才能取消操作
     */
    int CODE_1200120 = 1200120;

    /**
     * 请输入密码
     */
    int CODE_1200121 = 1200121;
}
